[
    {
        "level": "01-Start",
        "text": "You wake up, cold and alone. How long have you been in this cave? How did you get here? Questions flood your mind as you pick yourself up off the stone floor, but answers are nowhere to be found. A rusty sword lies next to you. Not knowing what may lay ahead, you pick it up. You are in a dark, dank cave and the only light is a single torch on the west wall. There is a path to the north and a path to the south. Both seem eerily quiet.",
        "modifier": 0,
        "options": [
            {
                "label": "Go North",
                "target": "02-Tunnel"
            },
            {
                "label": "Cry",
                "target": "01a-Cry"
            },
            {
                "label": "Do nothing",
                "target": "01b-Goblins"
            },
            {
                "label": "Inspect Torch",
                "target": "01c-Torch"
            }
        ]
    },
    {
        "level": "02-Tunnel",
        "text": "Deciding to to leave the cave behind you and find some answers to why you're here, you head north. Ahead of you is a short tunnel, that leads to a door that is slightly ajar. Opening it, you are faced with a small room. To your left is a closed door and to your right is the remains of both a fire and a poor adventurer that lies decomposing beside it. There is also a path that continues north.",
        "modifier": 0,
        "options": [
            {
                "label": "Open door",
                "target": "02a-Locked"
            },
            {
                "label": "Continue North",
                "target": "03-Three Paths"
            },
            {
                "label": "Relight fire",
                "target": "02b-Relight Fire"
            },
            {
                "label": "Inspect the adventurer",
                "target": "02c-Dead Adventurer"
            }
        ]
    },
    {
        "level": "01a-Cry",
        "text": "Tears run down your cheeks, as you feel completely lost. How did you get here? Whatever the case, that crying did make you feel a little better.",
        "modifier": [
            {
                "wisdom": 1
            }
        ],
        "options": [
            {
                "label": "Return to the task at hand",
                "target": "01-Start"
            }
        ]
    },
    {
        "level": "01b-Goblins",
        "text": "You decide to remain right where you are, and resign into a state of bewildered depression. After all, you didn't ask to be here. Before you can start to brood over the circumstances that led to your arrival, you hear some voices up ahead. It sounds like goblins!",
        "modifier": 0,
        "options": [
            {
                "label": "Flee",
                "target": "01ba-Goblin Flee"
            },
            {
                "label": "Hide",
                "target": "01bb-Goblin Hide"
            },
            {
                "label": "Bargain",
                "target": "01bc-Bargain"
            },
            {
                "label": "Fight",
                "target": "01bd-Goblin Battle"
            }
        ]
    },
    {
        "level": "01c-Torch",
        "text": "You approach the torch and take a closer look. You notice that this sconce is no typical one, as it can be removed from the wall. Additionally it appears to have some kind of flint and steel type of switch, which will reignite it if its flame goes out. Amazing! You extinguish the torch and add it to your inventory.",
        "modifier": [
            {
                "torch": 1
            }
        ],
        "options": [
            {
                "label": "Return to the task at hand",
                "target": "01-Start"
            }
        ]
    },
    {
        "level": "01ba-Goblin Flee",
        "text": "Terrified of what goblins might do if they see you, you attempt to run away. Sprinting to the back of the cave, you are only met with a cold, hard wall. You grope around in the darkness for some kind of opening, some escape from this hellhole. 'Well, what do we have here then?' a voice cackles behind you. You spin around to see your foe, but a goblin quickly dashes forward, plunging its dagger into your stomach and slashing it to the side, spilling your innards all over the floor. Darkness consumes everything.",
        "modifier": [
            {
                "death": 1
            }
        ]
    },
    {
        "level": "01bb-Goblin Hide",
        "text": "Realizing your only option may be to hide, you frantically search the room for a suitable hiding place, coming upon a boulder that might just be big enough to conseal you from your approaching doom. Wiping sweat from your brow, you wait. The voices have stopped. Maybe they've turned around and gone the other way? After a few moments, your curiosity gets the better of you and you shuffle around to peer over the boulder. There is a flash of steel, and you realize that the goblins were waiting for you. You hear their laughing and feel their blades as you die before them.",
        "modifier": [
            {
                "death": 1
            }
        ]
    },
    {
        "level": "01bc-Bargain",
        "text": "Holding the rusty sword loosely in your hand, you stand your ground as the goblins approach. As they enter the doorway, the stop in their tracks. 'Cor, look at this one. He looks ready for battle!' Knowing that all goblins love a good deal, you hold up your hands and explain that you'd rather offer them your sword. 'That thing doesn't look like it's worth the dirt under my nails', the goblin sneers. 'Tell ya what. We'll take your sword, in exchange for you life. Sound good? Good.' And with that, the goblins snatch up your weapon and disappear from the way they came. Damn. That weapon could have been useful. At least you're still breathing.",
        "modifier": [
            {
                "weapon": {
                    "name": "No weapon",
                    "dmg": 1
                }
            }
        ],
        "options": [
            {
                "label": "Return to the task at hand",
                "target": "01-Start Bargain Variant"
            }
        ]
    },
    {
        "level": "01-Start Bargain Variant",
        "text": "After the goblins leave, you reevaluate your choices. You are still in the dark, dank cave and the only light is a single torch on the west wall. There is a path to the north and a path to the south. Both still seem eerily quiet.",
        "modifier": 0,
        "options": [
            {
                "label": "Go North",
                "target": "02-Tunnel"
            },
            {
                "label": "Cry",
                "target": "01a-Cry"
            },
            {
                "label": "Inspect Torch",
                "target": "01c-Torch"
            }
        ]
    },
    {
        "level": "01bd-Goblin Battle",
        "text": "Gripping your sword confidently, you stand your ground. Two goblins enter the cave and stop in their tracks. 'This one looks feisty!', the uglier one cackles. The goblin murmors something to its partner, who runs off down the tunnel from which they entered. 'Don't worry sunshine, I'll deal with you myself.' The goblin unsheathes a sharp looking dagger, and steps forward to attack.",
        "modifier": [
            {
                "fight": 1
            }
        ],
        "enemy": {
            "name": "GOBLIN",
            "health": 40,
            "strength": 2,
            "defense": 2,
            "wisdom": 1,
            "luck": 1,
            "weapon": {
                "name": "dagger",
                "dmg": 3
            }
        },
        "options": [
            {
                "label": "Normal Attack",
                "target": "normal"
            },
            {
                "label": "Special Attack",
                "target": "special"
            },
            {
                "label": "Use health potion",
                "target": "potion"
            },
            {
                "label": "Use skill",
                "target": "skill"
            }
        ],
        "victory": {
            "target": "01bda-Goblin Victory"
        }
    },
    {
        "level": "01bda-Goblin Victory",
        "text": "You strike the goblin down, and its lifeless body hits the floor with a thump. You quickly rifle through its belongings, and find a few gold pieces. You also decide to take the weapon it was holding.",
        "modifier": [
            {
                "weapon": {
                    "name": "Dagger",
                    "dmg": 3
                }
            },
            {
                "gold": 3
            }
        ],
        "options": [
            {
                "label": "Return to the task at hand",
                "target": "01-Start Victory Variant"
            }
        ]
    },
    {
        "level": "01-Start Victory Variant",
        "text": "Giving the dead goblin one last kick to make sure he's dead, and decide to move on. You are still in the dark, dank cave and the only light is a single torch on the west wall. There is a path to the north and a path to the south. Both still seem eerily quiet. The other goblin that ran away is nowhere to be seen.",
        "modifier": 0,
        "options": [
            {
                "label": "Go North",
                "target": "02-Tunnel"
            },
            {
                "label": "Cry",
                "target": "01a-Cry"
            },
            {
                "label": "Inspect Torch",
                "target": "01c-Torch"
            }
        ]
    },
    {
        "level": "02a-Locked",
        "text": "Walking towards the door on your left, you try the handle. It's locked. Looking around for a key, you manage to spot one just poking out from beneath the door. You pick it up, wipe some dust off it, and place it in the keyhole.",
        "modifier": 0,
        "options": [
            {
                "label": "Open door",
                "target": "02aa-Open Door"
            },
            {
                "label": "Leave the door alone",
                "target": "02-Tunnel"
            }
        ]
    },
    {
        "level": "02aa-Open Door",
        "text": "Shrugging to no-one in particular, you turn the key in the lock. The door swings open wide, and inside you discover a small chamber. The walls are mostly made from shaped stone, and there's a broken chair in one corner. In an opposite corner, stands a fleshless skeleton, facing away from you. Upon hearing the door creak open, it turns around. It's hollow eyes shine blue, it's mouth hangs open, and it charges at you with its axe held high.",
        "modifier": [
            {
                "fight": 1
            }
        ],
        "enemy": {
            "name": "SKELETON",
            "health": 40,
            "strength": 1,
            "defense": 2,
            "wisdom": 1,
            "luck": 1,
            "weapon": {
                "name": "iron axe",
                "dmg": 4
            }
        },
        "options": [
            {
                "label": "Normal Attack"
            },
            {
                "label": "Special Attack"
            },
            {
                "label": "Use health potion"
            },
            {
                "label": "Use skill"
            }
        ],
            "victory": {
                "target": "02aaa-Skeleton Victory"
            }
        },
    {
        "level": "02aaa-Skeleton Victory",
        "text": "Upon your last attack, the skeleton falls apart and its bones clatter to the ground. You take its weapon, which also has some magical properties, and leave the room.",
        "modifier": [
            {
                "weapon": {
                    "name": "Dagger",
                    "dmg": 3
                }
            },
            {
                "wisdom": 1
            }
        ],
        "options": [
            {
                "label": "Return to the room",
                "target": "02-Tunnel Victory Variant"
            }
        ]
    },
    {
        "level": "02-Tunnel Victory Variant",
        "text": "Closing the door behind you, you return to the small room. The remains of the fire and a the adventurer that lies decomposing beside it are now in front of you. There is also a path to your left that continues north.",
        "modifier": 0,
        "options": [
            {
                "label": "Continue North",
                "target": "03-Three Paths"
            },
            {
                "label": "Relight fire",
                "target": "02b-Relight Fire"
            },
            {
                "label": "Inspect the adventurer",
                "target": "02c-Dead Adventurer"
            }
        ]
    },
    {
        "level": "03-Three Paths",
        "text": "Leaving the small room behind, you follow the path to the north. After a short walk, your path meets a crossroads. The road is split in three ways: The path to the west is dark, the one to the east smells like ash, and the path ahead to the north is a single door.",
        "modifier": 0,
        "options": [
            {
                "label": "Go Back",
                "target": "02-Tunnel Return Variant"
            },
            {
                "label": "Go West",
                "target": "04-Dark Path"
            },
            {
                "label": "Go North",
                "target": "?-Single Door"
            },
            {
                "label": "Go East",
                "target": "?-Ash Path"
            }
        ]
    },
    {
        "level": "02-Tunnel Return Variant",
        "text": "Feeling undecisive, you return to the small room with the dead adventurer.",
        "modifier": 0,
        "options": [
            {
                "label": "Open door",
                "target": "02a-Locked"
            },
            {
                "label": "Continue North",
                "target": "03-Three Paths"
            },
            {
                "label": "Relight fire",
                "target": "02b-Relight Fire"
            },
            {
                "label": "Inspect the adventurer",
                "target": "02c-Dead Adventurer"
            }
        ]
    },
    {
        "level": "04-Dark Path",
        "text": "You opt for the darker path to the North. It's hard to see exactly how far it stretches, all there is before you is inky blackness. There is a faint light at the end, which looks like it could be light from around a corner.",
        "modifier": 0,
        "options": [
            {
                "label": "Torch Obtained",
                "target": "04a-Torch Obtained"
            },
            {
                "label": "No Torch",
                "target": "04b-No Torch"
            }
        ]
    },
    {
        "level": "04a-Torch Obtained",
        "text": "Raising the torch above your head, you see that this path looks similar to the one you'd followed previously. The only difference is that of some of the cobbled stone floor is raised in parts. From a short distance, you lightly press a toe against one raised stone and a flurry of arrows shoot out of the wall beside you, narrowly missing your nose. Recognizing a trap when you see one and blessing your good fortune for taking the torch, you step through the corridor being careful to avoid the raised stones. You make it through the traps unscathed, but unfortunately your torch uses all of its fuel and splutters out of life.",
        "modifier": [
            {
                "torch": 0
            }
        ],
        "options": [
            {
                "label": "Continue",
                "target": "05-Sleeping Goblins"
            }
        ]
    },
    {
        "level": "04b-No Torch",
        "text": "Blindly continuing through the pitch black corridor, you step on something and hear a click, followed by a whoosh. You scream in pain as an arrow embeds itself in your calf. You yank the arrow out and consider whether you should continue going down this path. Who knows how many more traps there are?",
        "modifier": [
            {
                "health": -10
            }
        ],
        "options": [
            {
                "label": "Continue",
                "target": "04ba-Continue"
            },
            {
                "label": "Go Back",
                "target": "03-Three Paths Dark Variant"
            }
        ]
    },
    {
        "level": "03-Three Paths Dark Variant",
        "text": "Leaving the dark way and part of your pride behind you, you return to the crossroads. The road is split in three ways: The path to the west behind you is dark, the one to the east smells like ash, and the path ahead to the north is a single door. Or you could return to the small room before.",
        "modifier": 0,
        "options": [
            {
                "label": "Small Room",
                "target": "02-Tunnel Return Variant"
            },
            {
                "label": "Go West",
                "target": "04-Dark Path"
            },
            {
                "label": "Go North",
                "target": "?-Single Door"
            },
            {
                "label": "Go East",
                "target": "?-Ash Path"
            }
        ]
    },
    {
        "level": "04ba-Continue",
        "text": "By either incredible courage or plain stupidity, you decide to continue down the dark, trap-ridden path.",
        "modifier": [
            {
                "luckCheck": true
            }
        ],
        "options": [
            {
                "label": "Check Your Luck",
                "target": "04baa-Check Luck"
            }
        ]
    }
    

]